/*11. Подмассив наибольшей суммы
		Определите максимальную сумму в подмассиве
		
		// Setup
		var a = [
			[1, -10, 4, 5],
			[1, 5, 5, 3],
			[-1, 8, 4, 1],
			[1, -10, -4, 5],
			[1, 10, 4, 0],
		];
		Например:
		var a = [
			[1, 3, 6], 
			[3, 1, -1], 
			[3, 0]
		];
		
		Максимальная сумма тут первого подмассива: 1 + 3 + 6 = 10;
		Ответ: 10*/


var a = [
			[1, -10, 4, 5],
			[1, 5, 5, 3],
			[-1, 8, 4, 1],
			[1, -10, -4, 5],
			[1, 10, 4, 0],
		]

       /* var sum = a[0][0] + a [0][1] + a[0][2] + a[0][3];
        console.log("Максимальная сумма первого подмассива = " + sum);

        var sum = a[1][0] + a [1][1] + a[1][2] + a[1][3];
        console.log("Максимальная сумма первого подмассива = " + sum);

        var sum = a[2][0] + a [2][1] + a[2][2] + a[2][3];
        console.log("Максимальная сумма первого подмассива = " + sum);

        var sum = a[3][0] + a [3][1] + a[3][2] + a[3][3];
        console.log("Максимальная сумма первого подмассива = " + sum);

        var sum = a[4][0] + a [4][1] + a[4][2] + a[4][3];
        console.log("Максимальная сумма первого подмассива = " + sum);*/



        for (var i = 0; i < a.length; i++){
            var sum = 0;
            var max = 0;
            for (var j = 0; j < a[i].length; j++){
                sum += a[i][j]; 
            }
            if (sum > max){
                max = sum;
            }
        }
        console.log(max);        
       
     